{ "translations": {
    "Image generation ready" : "Xeración de imaxes lista",
    "View" : "Ver",
    "Delete" : "Eliminar",
    "AI image generation" : "Xeración de imaxes con IA",
    "No text to image processing provider available" : "Non hai ningún provedor de procesamento de texto para imaxes dispoñíbel",
    "Image generation has been deleted." : "Eliminouse a xeración de imaxes.",
    "Image generation not found." : "Non se atopou a xeración de imaxe.",
    "Image generation failed." : "Produciuse un fallo na xeración da imaxe.",
    "Image file names could not be fetched from database" : "Non foi posíbel recuperar os nomes dos ficheiros de imaxe da base de datos",
    "Image request error" : "Produciuse un erro na solicitude de imaxe",
    "Image file not found in database" : "Non se atopou o ficheiro de imaxe na base de datos",
    "Image file not found" : "Non se atopou o ficheiro de imaxe",
    "Text2Image helper" : "Axudante Text2Image",
    "A Smart Picker for interfacing with text-to-image providers" : "Un selector intelixente para interactuar con provedores de texto a imaxe",
    "⚠️ This app is now deprecated. The feature it provides is now included in the [Assistant app](https://apps.nextcloud.com/apps/assistant).\n\nThis app adds a Smart Picker for interfacing with text-to-image providers like the on-premises stable diffusion integration.\n\nThe Smart Picker enables you to generate an image or multiple images based on a text prompt.\n\nIf multiple images are requested and/or the generation will take a long time. The user can request to be notified\nonce the generated image(s) are ready." : "⚠️ Esta aplicación xa está obsoleta. A función que ofrece agora está incluída na [aplicación Asistente](https://apps.nextcloud.com/apps/assistant).\n\nEsta aplicación engade un selector intelixente para interactuar con provedores de texto a imaxe como a integración de Stable Diffusion local.\n\nO Selector intelixente permítelle xerar unha imaxe ou varias imaxes baseadas nunha indicación de texto.\n\nSe se solicitan varias imaxes e/ou a xeración levará moito tempo. O usuario pode solicitar ser notificado\nunha vez que as imaxes xeradas estean listas.",
    "Image generation - Text2Image Helper" : "Xeración de imaxes – Axudante Text2Image",
    "Here you can define the settings for the Text2Image helper smart picker." : "Aquí pode definir os axustes para o selector intelixente do axudante Text2Image.",
    "Max generation idle time (days): " : "Tempo máximo de inactividade da xeración (días):",
    "Maximum number of days an image can be idle (not viewed) before it is deleted" : "Número máximo de días que unha imaxe pode estar inactiva (non vista) antes de que se elimine",
    "Text2Image Helper admin options saved" : "Gardáronse as opcións de administración do Axudante Text2Image",
    "Failed to save Text2Image Helper admin options" : "Produciuse un fallo ao gardar as opcións de administración do axudante de Text2Image",
    "Image generation" : "Xeración de imaxes",
    "Edit visible images" : "Editar as imaxes visíbeis",
    "Click to toggle generation visibility" : "Prema para cambiar a visibilidade da xeración",
    "Generated image" : "Imaxe xerada",
    "This generation has no visible images" : "Esta xeración non ten imaxes visíbeis",
    "Estimated generation time left: " : "Tempo restante estimado de xeración:",
    "The generated image is shown once ready." : "A imaxe xerada amosarase unha vez estea lista.",
    "Image generation failed" : "Produciuse un fallo na xeración da imaxe.",
    "Unexpected server response" : "Resposta non agardada do servidor",
    "Rate limit reached. Please try again later." : "Acadouse o límite da taxa. Tenteo de novo máis tarde.",
    "Unknown server query error" : "Produciuse un erro de consulta de servidor descoñecido",
    "ERROR: No image generation provider available" : "ERRO: non hai ningún provedor de xeración de imaxes dispoñíbel",
    "AI Image Generation" : "Xeración de imaxes con IA",
    "Preview" : "Vista previa",
    "Show/hide advanced options" : "Amosar/agochar as opcións avanzadas",
    "Advanced options" : "Opcións avanzadas",
    "Preview image generation by AI" : "Vista previa da xeración de imaxes mediante IA",
    "Notify when ready" : "Notificar cando estea listo",
    "Submit image(s) generated by AI" : "Enviar imaxes xeradas por IA",
    "Send" : "Enviar",
    "Include the prompt in the result" : "Incluír a indicación no resultado",
    "Number of results" : "Número de resultados",
    "A hedgehog laid back on a couch" : "Un ourizo deitado nun sofá",
    "Regenerate" : "Rexenerar",
    "Image generation cancel error" : "Produciuse un erro de cancelación de xeración de imaxe",
    "Unknown image generation cancel error" : "Produciuse un erro descoñecido de cancelación de xeración de imaxe",
    "Unexpected response from server." : "Resposta non agardada do servidor.",
    "Image generation error" : "Produciuse un erro de xeración de imaxe",
    "Unknown image generation error" : "Produciuse un erro descoñecido de xeración de imaxe",
    "You will be notified when the image generation is ready." : "Recibirá unha notificación cando a xeración de imaxes estea lista.",
    "Notify when ready error" : "Produciuse un erro ao notificar cando está listo",
    "Unknown notify when ready error" : "Produciuse un error descoñecido ao notificar cando está listo",
    "Copy link to clipboard" : "Copiar a ligazón no portapapeis",
    "Link copied to clipboard" : "A ligazón foi copiada no portapapeis.",
    "Failed to copy link to clipboard" : "Produciuse un fallo ao copiar a ligazón no portapapeis:"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}